---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.EndTreatmentType
source: html/004fe311-1d58-1f77-5380-174edcc7f831.htm
---
# EndTreatmentType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.